app/controllers/product_controller.rb

SELECT * FROM `big_categories`
SELECT * FROM `products` WHERE (id in (1,2,3)) LIMIT 0, 3
---
  def index
    @big_category = BigCategory.all
    @product = Product.find(:all ,:order => "created_at",:limit => 3)

SELECT * FROM `big_categories`
SELECT * FROM `products` LIMIT 0, 3
SELECT count(1) AS count_1 FROM `products`
---
  def show_all
    @will_paginate = "yes"
    @big_category = BigCategory.all
    @product = Product.paginate :page => params[:page], :per_page => 5

SELECT * FROM `big_categories`
SELECT * FROM `big_categories` WHERE (`big_categories`.`id` = '1') LIMIT 1
SELECT * FROM `middle_categories` WHERE (`middle_categories`.big_category_id = 2)
---
  def show_middle_category
    @big_category_id = params[:big_category_id]
    @big_category = BigCategory.all
    @middle = BigCategory.find_by_id(params[:big_category_id]).middle_categorys

SELECT * FROM `big_categories` WHERE (`big_categories`.`id` IS NULL) LIMIT 1
SELECT * FROM `middle_categories` WHERE (`middle_categories`.big_category_id = 1)
---
  def show_small_category
    middle = MiddleCategory.find_by_id(params[:middle_category_id]) #根据id找到middle对象

SELECT * FROM `big_categories`
SELECT * FROM `products` WHERE (small_category_id = '1') LIMIT 0, 5
SELECT count(1) AS count_1 FROM `products` WHERE (small_category_id = '1')
---
  def show_products
    @big_category = BigCategory.all
    @product = Product.paginate(:all , :page => params[:page], :per_page => 5,:conditions => ["small_category_id = ?",params[:id]])

SELECT * FROM `big_categories`
SELECT * FROM `products` WHERE (`products`.`id` IS NULL) LIMIT 1
---
  def product_detail
    @big_category = BigCategory.all
    @p = Product.find_by_id(params[:id])

SELECT * FROM `big_categories`
SELECT * FROM `products` WHERE (name like '%3%' or description like '%3%' ) LIMIT 0, 3
SELECT count(1) AS count_1 FROM `products` WHERE (name like '%3%' or description like '%3%' )
---
  def search_products
    @will_paginate = "yes"
    @big_category = BigCategory.all
    @product = Product.paginate(:all ,:page => params[:page], :per_page => 10, :conditions => ["name like ? or description like ? " , "%#{params[:query]}%","%#{params[:query]}%"])