app/controllers/shopping_cart_controller.rb

SELECT * FROM `big_categories`
---
  def cart
	pp "github.com"
    @big_category = BigCategory.all

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
   def add_to_cart
       product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 16)
---
  def delete
    product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 16)
---
  def update_quantity
    product = Product.find(params[:id])