app/controllers/users_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
	pp "ddd"

    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('50233fe1d2f689f471745dde71cb8d5af71d0113', '2012-11-28 03:18:29', 'bdfcfe338dc3d2ad34f637e5bd10fdf8b22a9a16', NULL, '2012-11-28 03:18:29', NULL, 'yonghu1', 'yonghu1@163.com')
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!